{
  "basics": {
    "name": "Daniel Benítez Restrepo",
    "label": "Systems and Computation Engineer, MP: 17950-259048 CLD",
    "picture": "https://da8y01.github.io/gh-blog/CV/picture202201_1.jpeg",
    "email": "danielbenitezr@yahoo.com",
    "phone": "(+57) 300 000 0000",
    "website": "https://da8y01.github.io/gh-blog/CV/cv202308_1.html",
    "summary": "I'm a Systems and Computation Engineer from Universidad de Caldas (Manizales-Colombia). I'm an intellectual man who likes culture, science and arts. I adapt myself with ease to the circumstances, I'm a compromised, accomplished and responsible person when activities to carry out have been assigned, and my intellectual inquietude allows me to learn and research new stuff efficiently.",
    "location": {
      "address": "2712 Circunvalar Av",
      "postalCode": "BOG 170001",
      "city": "Bogotá",
      "countryCode": "CO",
      "region": "Cundinamarca"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "danielbenitezr",
        "url": "https://www.linkedin.com/in/daniel-b-3b070990/"
      },
      {
        "network": "GitHub",
        "username": "da8y01",
        "url": "https://github.com/da8y01"
      },
      {
        "network": "Bitbucket",
        "username": "01ring",
        "url": "https://bitbucket.org/01ring"
      },
      {
        "network": "GitLab",
        "username": "da8y01",
        "url": "https://gitlab.com/da8y01"
      }
    ]
  },
  "work": [
    {
      "company": "University of Caldas",
      "position": "Programming tutor Cycle 4A (web)",
      "website": "https://www.ucaldas.edu.co/portal/",
      "startDate": "2022-10-14",
      "endDate": "2022-11-26",
      "summary": "The University of Caldas in compliance with the social function that corresponds to its public nature, has the mission of generating, appropriating, disseminating and applying knowledge through curricular, investigative and projection processes, to fully train citizens committed to society and culture, provide solutions to regional, national and international problems and contribute to sustainable development.",
      "highlights": [
        "Project: MISIÓN TIC 2022 SAR I-704/2022.",
        "Stack: Backend services with LoopBack, frontend web applications with Angular and ReactJS, HTML/JS/CSS for web modeling, MongoDB document storage.",
        "Infrastructure: SO Windows, Microsoft Teams for communications, Google Drive as file storage, CVS with git and GitHub repositories.",
        "Concerns: Carry out accompaniment in the teaching activities in programming guided by the disciplinary trainer, Carry out work team dynamics, Manage the solution of questions and concerns made by the beneficiaries, Support the training and teaching of programming in the languages and technologies that are going to be use in the cycle, Generate at least weekly reports determined by the training operator, Sprint follow-up through the formats designed for it (Teach lead), Participate in daily follow-up meetings with their work groups, The tutor It has the responsibility of reporting any non-compliance detected in the monitoring activities, Submitting weekly reports of its management and monthly report."
      ]
    },
    {
      "company": "10Pearls",
      "position": "Backend Developer",
      "website": "https://10pearls.com/",
      "startDate": "2022-04-25",
      "endDate": "2022-06-16",
      "summary": "We help businesses digitally transform, build new products, and accelerate digital teams.",
      "highlights": [
        "Project: 10Pearls training program to improve English skills.",
        "Infrastructure: Windows 10 Operating System, Microsoft Teams for communications, Microsoft Office as office suite.",
        "Concerns: Attend English language skills improvement training."
      ]
    },
    {
      "company": "Alejandra Sierra",
      "position": "Software Developer",
      "website": "https://www.alejasierra.com/",
      "startDate": "2022-01-06",
      "endDate": "2022-04-06",
      "summary": "Advertising and web design company.",
      "highlights": [
        "Project: Portal Sociedad de Diagnóstico Visual S.A.S.",
        "Stack: Backend services with NodeJS/ExpressJS, client web application with Angular, web layout with HTML/CSS/JS.",
        "Infrastructure: Windows 10 Operating System, CentOS 7 VPS, WhatsApp instant messaging, CVS with git and GitHub repositories, Google Docs as office suite, Figma tool for conversion/translation of the graphical design piece into HTML markup language format.",
        "Concerns: Develop the back-end server with NodeJS/ExpressJS, and the front-end client application with Angular; CVS, databases and VPS deployments setup management."
      ]
    },
    {
      "company": "PrimeStone",
      "position": "Application Developer Analyst",
      "website": "https://primestone.com/",
      "startDate": "2021-07-01",
      "endDate": "2022-01-28",
      "summary": "PrimeStone, a Trilliant company, is a proudly Colombian privately held software development company founded in 1990 by a team of industry experts, with over 25 years of experience in meter data collection, management and analytics.",
      "highlights": [
        "Project: A middleware to provide functionalities of migration and synchronization of databases.",
        "Stack: Apache NiFi, Python/Flask, Oracle 11g, MS SQL Server 2012, PostgreSQL 9, Docker/Docker Compose.",
        "Infrastructure: Windows 10, Git repositories, VS Code, Team Foundation Server, Microsoft Teams, VPN.",
        "Concerns: Modification of Apache NiFi templates and Python/Flask application to manage the launch and parametrization of the data and operations flows.",
        "Project: A Interoperability Readings Dashboard to visualize metrics on devices and other data sources.",
        "Stack: Python/Flask, Dash/NumPy/Pandas/Cognito libraries, AWS S3/Glue/Lambdas, Docker/Docker Compose.",
        "Infrastructure: Windows 10, Git repositories, VS Code, Team Foundation Server, Microsoft Teams, VPN, AWS.",
        "Concerns: Implementation of User Stories regarding building layers for UI, callbacks and data for the vizualization dashboard, unit tests of Python source code, implementation of authentication for Python/Flask application using Cognito library, use and activation of AWS Glue flows involving buckets, lambdas, functions, services, parsers, etc.",
        "Project: A static and dummy API backend server with endpoints to be consumed by clients.",
        "Stack: NodeJS server, Angular client, HTML/CSS/JS, Docker/Docker Compose.",
        "Infrastructure: Windows 10, Git repositories, VS Code, Team Foundation Server, Microsoft Teams, VPN.",
        "Concerns: Development of backend API endpoint services to be used by clients, modification of Angular web application."
      ]
    },
    {
      "company": "Kibernum Colombia",
      "position": "Full-Stack Developer",
      "website": "https://www.kibernum.com/",
      "startDate": "2021-02-08",
      "endDate": "2021-04-23",
      "summary": "As one of the largest and longest established IT firms in Latin America, Kibernum offers not just engineering expertise and innovation but also the reliability to get the job done.",
      "highlights": [
        "Project: COBIS banking platform.",
        "Stack: SQL Server database, Maven packages manager, Java, Tomcat and JBoss web applications containers, usage of AngularJS library on the client web application, HTML/CSS/JS for web modeling.",
        "Infrastructure: Windows 10 Operating System, Sonar code quality tool, Eclipse IDE, COBIS Designer, TFS (Team Foundation Server), Microsoft Teams for communications, VPN, agile principles of software development.",
        "Concerns: Integration and customization of banking modules through debugging of application flow with Eclipse, Maven and Java, with SQL Server, AngularJS and COBIS Designer, applications debugging."
      ]
    },
    {
      "company": "Soft Dev Team",
      "position": "Full-Stack Developer",
      "website": "https://softdev.team/",
      "startDate": "2020-07-16",
      "endDate": "2020-10-15",
      "summary": "Fully-managed On-demand Software Development Team.",
      "highlights": [
        "Project: Logistics company, management, monitoring and traceability of resources such as warehouses, vehicles, forms, etc.",
        "Stack: Back-end services with Firebase, front-end web app with ReactJS, mobile app with ReactNative.",
        "Infrastructure: Linux OS, git, GitHub, Firebase, Slack, Zoom, Notion, Monday, Scrum.",
        "Concerns: Development of front-end features with ReactJS.",
        "Project: 321 Ignition, platform to enable mobile services for vehicle dealers.",
        "Stack: Micro-services with NodeJS, front-end templates with VueJS and ReactJS, unit tests with Jest library, MongoDB document storage, RabbitMQ message manager, ElasticSearch search engine, virtualization with Docker, cloud resource management with GCP (Google Cloud Platform).",
        "Infrastructure: Linux OS, git, GitHub, Google Cloud Platform, Slack, Zoom, Jira, Scrum.",
        "Concerns: Development of back-end features with NodeJS, asynchronous programming with queues, RabbitMQ, searches, ElasticSearch, MongoDB management, database migrations, development of unit tests with Jest library, development of integration tests with Jest, PostgreSQL and GitHub environments, application deployment."
      ]
    },
    {
      "company": "Heinsohn Business Technology",
      "position": "Developer Engineer Junior Advanced",
      "website": "https://www.heinsohn.com.co/",
      "startDate": "2019-04-10",
      "endDate": "2020-04-15",
      "summary": "We support our customers with IT solutions to the size of their needs.",
      "highlights": [
        "Project: Tresiba web, comprehensive platform to manage information on the concentration of glucose and insulin in the blood (FBG, fast blood glucose).",
        "Stack: Back-end server with SpringBoot, client web application with Angular, PostgreSQL and MySQL databases, native mobile applications for iOS and Android systems, auxiliary device for reading fasting glucose (FBG) information.",
        "Infrastructure: Windows 10 Pro Operating System, Microsoft Remote Desktop, GCP (Google Cloud Platform) and GKE (Google Kubernetes Engine) cloud services, Slack, Zoom, Jira, Confluence, Scrum.",
        "Concerns: Development of front-end features with the Angular framework, use of the Material library for UX/UI interface components, use of libraries for state management and RxJS functionalities such as Redux, management of CVS git and BitBucket repositories, interaction with an international team and command of the advanced written and spoken English language.",
        "Project: New EPS Forms, auxiliary system of forms of an EPS (Health Provider Entity).",
        "Stack: Drupal CMS (Content Management System), PHP language, MySQL database.",
        "Infrastructure: Windows 10 Pro and Linux (Ubuntu) operating systems, Microsoft Remote Desktop, VPNs, Slack, Skype, MS Excel, Scrum.",
        "Concerns: Implementation of web forms and data requests to external services/APIs/endpoints with the CMS Drupal 8."
      ]
    },
    {
      "company": "SuperLikers",
      "position": "Front-end developer",
      "website": "http://www.superlikers.com/",
      "startDate": "2016-03-15",
      "endDate": "2019-03-31",
      "summary": "Superlikers is an online platform to setup and manage 360 Fidelization Programs.",
      "highlights": [
        "Project: SuperLikers, web system for the management of gamified platforms.",
        "Stack: Back-end server with Ruby on Rails and SinatraRb, client web app with AngularJS/Angular, MongoDB document storage, Redis, Memcached.",
        "Infrastructure: Linux (Ubuntu) and Windows (7, 10) Operating Systems, AWS services, EC2 instances, S3 buckets, CVS with git and Unfuddle, BitBucket and GitHub repositories, Slack, Trello, Scrum.",
        "Concerns: Migration of an administrative panel type web application using the AngularJS library to the Angular framework, development of front-end features with Angular (versions 2, 4, 5, 6), JavaScript, jQuery, HTML, CSS, Material UX/UI library, consumption of APIs/endpoints/remote services."
      ]
    },
    {
      "company": "Ignite Technologies",
      "position": "Full-stack developer",
      "website": "http://ignite.com.co/",
      "startDate": "2018-06-20",
      "endDate": "2018-09-30",
      "summary": "We're a colombian enterprise concerned with the design and development of innovation technologies, engineering and science products. Our focus is directed towards processes optimization based upon technology based solutions for our clients and users.",
      "highlights": [
        "Project: Mr. Quick, mobile application for food services and restaurants.",
        "Stack: Back-end server with Ruby on Rails, hybrid mobile app with Ionic 4, PostgreSQL database, CVS with git and GitLab repository.",
        "Infrastructure: Linux (Ubuntu) and Windows (7, 10) Operating Systems, AWS services, S3 buckets, Slack, Scrum.",
        "Concerns: Migration, development and update of a mobile application using the Ionic 4 hybrid application framework, development of back-end features with Ruby on Rails, management of Git repositories and AWS services.",
        "Project: HandleBay, website similar to a social network for suppliers, customers, intermediaries, companies.",
        "Stack: Web application with Ruby on Rails, PostgreSQL database, CVS with git and GitLab repository, Unicorn and Passenger application servers.",
        "Infrastructure: Linux (Ubuntu) and Windows (7, 10) Operating Systems, AWS services, EC2 and AMI instances, S3 buckets, Slack, Scrum.",
        "Concerns: Development with the Ruby on Rails framework of a web application according to the project specifications."
      ]
    },
    {
      "company": "Mapalé Software",
      "position": "Developer",
      "website": "http://www.mapalesoftware.com.co/",
      "startDate": "2015-02-01",
      "endDate": "2016-02-29",
      "summary": "We are a team of developers/designers/scientists/geeks who find their work very entertaining and thrilling. As a team, we develop software in different areas, with emphasis in web and mobile, but with experience in telephony projects, digital kiosks, enterprise applications, security systems, Artificial Intelligence, cryptography and even artistic installations.",
      "highlights": [
        "Project: Houspoon, web application that coordinates chefs, reservations and food services at home.",
        "Stack: Back-end server with NodeJS, front-end web app with ReactJS, mobile app with ReactNative, PostgreSQL database, CVS with git and BitBucket repositories.",
        "Infrastructure: Linux OS, Heroku cloud PaaS, Slack for communications, Toggl for task management, Scrum for project management.",
        "Concerns: Development of back-end features with NodeJS, implementation of unit tests with Mocha library, implementation of integration tests with PostgreSQL database, development with ReactJS and Redux state library.",
        "Project: Subscription System, subscription management and integrations with an external marketing service (Mailchimp).",
        "Stack: Back-end server with Django framework, PostgreSQL database, CVS with git and BitBucket repositories.",
        "Infrastructure: Linux Operating System, Slack for communications, Toggl for task management, Scrum for project management.",
        "Concerns: Development of back-end features with the Django framework, thread management, remote service calls.",
        "Project: Coquelux, virtual clothing store.",
        "Stack: Back-end server with PHP, front-end web application with AngularJS library, PostgreSQL and MySQL databases, CVS with git and GitHub repositories.",
        "Infrastructure: Linux Operating System, Docker for container management and virtualization, web servers (Apache), Slack for communications, Toggl for task management, Scrum for project management.",
        "Concerns: Development of back-end features with PHP, development of front-end features with the AngularJS library.",
        "Project: Logistics System, web application that consumes, processes and publishes WebServices or remote SOAP and REST backend APIs with information regarding logistics such as addresses, couriers, orders, packages, deliveries.",
        "Pila: Back-end server with the PHP Silex framework, Postgres and MySQL databases, Doctrine and Phinx libraries for database management and migrations, CVS with git and GitHub repositories.",
        "Infrastructure: Linux Operating System, Docker for container management and virtualization, web servers (Apache), Slack for communications, Toggl for task management, Scrum for project management.",
        "Concerns: Development of back-end features with the Silex framework.",
        "Project: SmartReader, web application for reading and smart quizzes of published articles and readings.",
        "Stack: Back-end server with Ruby on Rails framework, front-end web application with AngularJS library, PostgreSQL database, CVS with git and BitBucket repositories.",
        "Infrastructure: Linux Operating System, Heroku for cloud deployments using PaaS, Slack for communications, Toggl for task management, Scrum for project management.",
        "Concerns: Development of back-end features with the Ruby on Rails framework, development of front-end functionalities with the AngularJS library."
      ]
    },
    {
      "company": "Kommit",
      "position": "Software Developer",
      "website": "https://kommit.co/",
      "startDate": "2014-05-20",
      "endDate": "2015-01-13",
      "summary": "We are a USA based company with roots in Latin-American. Our mission is to find and enable talented people in that region to work remotely with North American companies.",
      "highlights": [
        "Project: Medical Agenda, progressive web application (PWA) for the management of doctors, patients, agendas and interactions.",
        "Stack: Remote backend services using BaaS (Heroku), Progressive Web App (PWA) using a Google Chrome extension with AngularJS library, CVS with git and GitHub repositories.",
        "Infrastructure: Linux (Ubuntu, Debian) Operating System, Slack for communications, Scrum for project management.",
        "Concerns: Web development of a PWA using the AngularJS library.",
        "Project: Civico, web portal for monitoring, collecting, tracking and recommending places, events and news of different cities.",
        "Stack: Ruby on Rails web application, MongoDB NoSQL database, Mongoid Object-Document Mapper (ODM) driver, CVS with git and GitHub repositories.",
        "Infrastructure: Linux (Ubuntu, Debian) Operating System, Memcached and Redis tools, Slack for communications, Scrum for project management.",
        "Concerns: Web development using the Ruby on Rails framework."
      ]
    },
    {
      "company": "Webde Development System",
      "position": "Programmer",
      "website": "https://www.webdefamily.com/",
      "startDate": "2014-01-03",
      "endDate": "2014-03-05",
      "summary": "We connect your company with more clients through the internet. Marketing services focused on results.",
      "highlights": [
        "Project: Funeral Company, web application with mobile application for contract and insurance management of a funeral company.",
        "Stack: Ruby on Rails web app, PostgreSQL database, hybrid mobile app with Appcelerator Titanium, CVS with git and GitLab repositories.",
        "Infrastructure: Linux Operating System (Ubuntu), PaaS in the Heroku cloud, Scrum for project management.",
        "Concerns: Hybrid mobile application development with Appcelerator Titanium, web application development with Ruby on Rails, consumption, processing and publication of SOAP (Simple Object Access Protocol) and REST (Representational state transfer) web services, management of databases and web servers, CVS.",
        "Project: IT website, main website of an IT service company.",
        "Stack: Ruby on Rails web app, MySQL database, CVS with git and GitLab repositories.",
        "Infrastructure: Linux Operating System (Ubuntu), PaaS in the Heroku cloud, Scrum for project management.",
        "Concerns: Web application development with Ruby on Rails, management of databases and web servers, CVS."
      ]
    },
    {
      "company": "Clínica San Francisco S.A.",
      "position": "Systems Engineer",
      "website": "http://www.clinicasanfrancisco.com.co/",
      "startDate": "2013-07-29",
      "endDate": "2013-10-28",
      "summary": "Clínica San Francisco S.A. is a private institution offering high complexity healthcare services at the middle and north of Valle region (Tuluá, Valle del Cauca).",
      "highlights": [
        "Project: SIIS, Integrated Health Information System of a clinic that works as a web application.",
        "Stack: Backend services with PHP, client web application with jQuery/HTML/CSS, PostgreSQL database, CVS with Subversion (svn) and local shared repositories, TortoiseSVN client application, NetBeans IDE.",
        "Infrastructure: Linux Operating System (Ubuntu, CentOS), Apache web server, RedMine for task management, project management based on RUP (Relational Unified Process).",
        "Concerns: Development and implementation of different activities focused on modifying and/or adding functionalities to the entity's SIIS, programming in PHP web server-side language and JavaScript/jQuery web client-side language, web modeling with HTML/CSS, optimization of SQL queries, provide general IT support."
      ]
    },
    {
      "company": "Digitex Internacional Ltda.",
      "position": "Call Center Operator",
      "website": "http://www.grupodigitex.com/",
      "startDate": "2013-04-12",
      "endDate": "2013-06-14",
      "summary": "We partner with clients to deliver outstanding customer experience.",
      "highlights": [
        "Project: Chile’s Saltas Outbound sell campaign to offer SIM cards chips.",
        "Stack: Hermes software to handle outgoing calls, notepad.",
        "Infrastructure: Windows Operating System, MS Excel to complete the formats used.",
        "Concerns: Make calls with the software to potential clients in Chile to offer and sell SIM cards."
      ]
    },
    {
      "company": "Latinia Mobile Infrastructure",
      "position": "Analyst Developer",
      "website": "https://www.latinia.com/",
      "startDate": "2012-04-10",
      "endDate": "2012-08-29",
      "summary": "Latinia is an independent software vendor (ISV), which specializes in infrastructure product development for asynchronous type financial notifications or push banking(mobile or instant messaging, email, Twitter’s DM, push notifications – Android & Apple iOS), utilized mainly by leading and globally distributed financial institutions (banks, savings banks, processing and payment systems), public institutions government and service providers, distributing the same globally and acting as leaders in their respective segments and industries.",
      "highlights": [
        "Project: Instant messaging and secondary notifications broker of a financial institution.",
        "Stack: Backend services with JavaEE (Java Enterprise Edition)/EJB (Enterprise Java Beans)/JMS (Java Messaging Services), Oracle 11g database, test client applications with JSP (Java Server Pages), Servlets, and JavaSE (Java Standard Edition), Ant and Maven packaging and deployment tools, Eclipse IDE.",
        "Infrastructure: Windows (7), Linux (CentOS 5) Operating Systems, Virtual Machines (VMs) with VMware Player, WebLogic and JBoss application containers.",
        "Concerns: Development of features to test and monitor the traffic of sending messages with different characteristics (channel, attachments, quantity, intervals, etc.) of a notification and messaging broker middleware using JavaEE and JavaSE technologies, Oracle database management, management of WebLogic and JBoss containers, management of Ant and Maven software management tools."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Manizales-Dev",
      "position": "Participant/Volunteer",
      "website": "http://manizales-dev.github.io/",
      "startDate": "2015-02-15",
      "endDate": "2017-08-11",
      "summary": "Manizales-Dev is a community of local developers to build together an ecosystem around technology to bring support to individuals and organizations towards regional progress.",
      "highlights": [
        "Participation on different meetup events organized.",
        "KodeFest 2017",
        "NodeSchool International Day 2016 (Chapter Manizales)",
        "Global Day of Coderetreat 2015",
        "Participation in XIV Jornadas de Ingeniería, Tecnología e Innovación 2015 at Universidad de Caldas ( http://jornadas-ingenieria.gitir.co/ ).",
        "HTML5 and JavaScript, Omnipresent future",
        "NodeSchool International Day 2015 ( http://nodeschool.io/manizales/ )."
      ]
    }
  ],
  "education": [
    {
      "institution": "Universidad de Caldas",
      "area": "Systems and Computation Engineering",
      "studyType": "Professional Career",
      "startDate": "2004-08-01",
      "endDate": "2013-07-09"
    },
    {
      "institution": "National Administrative Department of Statistics - DANE",
      "area": "Design and construction of indicators (2023-I A-23)",
      "studyType": "Virtual Course",
      "startDate": "2023-02-09",
      "endDate": "2023-04-08"
    },
    {
      "institution": "National Administrative Department of Statistics - DANE",
      "area": "Configuration of administrative records for statistical use (2023-I A-23)",
      "studyType": "Virtual Course",
      "startDate": "2023-02-09",
      "endDate": "2023-04-08"
    },
    {
      "institution": "Environmental Institute GIS",
      "area": "Environmental Research Week",
      "studyType": "Virtual Training",
      "startDate": "2022-09-12",
      "endDate": "2022-09-16"
    },
    {
      "institution": "PyCon Colombia",
      "area": "PyCon Colombia 2022 Online Conference",
      "studyType": "Online Conference",
      "startDate": "2022-07-09",
      "endDate": "2022-07-10"
    },
    {
      "institution": "University of Minnesota",
      "area": "Engineering Practices for Building Quality Software",
      "studyType": "Virtual Course",
      "startDate": "2021-11-29",
      "endDate": "2021-12-20"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "2312659 - Special course on Bar and Table Basics",
      "studyType": "Virtual Course",
      "startDate": "2021-07-01",
      "endDate": "2021-08-04"
    },
    {
      "institution": "BIOS (Bioinformatics and Computational Biology Center of Colombia)",
      "area": "Course 22 Introduction to Graphic Computation and Scientific Visualization",
      "studyType": "Classroom Course",
      "startDate": "2017-09-06",
      "endDate": "2017-09-08"
    },
    {
      "institution": "University of Manizales with OWASP organization",
      "area": "OWASP Latam Tour 2017",
      "studyType": "Onsite event",
      "startDate": "2017-04-03",
      "endDate": "2017-04-03"
    },
    {
      "institution": "Microsoft Developer Readiness",
      "area": "Xamarin Diplomado | Intermediate level",
      "studyType": "Virtual Course",
      "startDate": "2017-01-01",
      "endDate": "2017-03-01"
    },
    {
      "institution": "École Polytechnique Fédérale de Lausanne",
      "area": "Parallel programming",
      "studyType": "Virtual Course",
      "startDate": "2016-12-12",
      "endDate": "2017-01-02"
    },
    {
      "institution": "University of Washington",
      "area": "Machine Learning: Regression",
      "studyType": "Virtual Course",
      "startDate": "2016-10-10",
      "endDate": "2016-11-14"
    },
    {
      "institution": "École Polytechnique Fédérale de Lausanne",
      "area": "Functional Program Design in Scala",
      "studyType": "Virtual Course",
      "startDate": "2016-10-24",
      "endDate": "2016-11-07"
    },
    {
      "institution": "Ruta-N with JSConf Colombia",
      "area": "JSConf Colombia 2016",
      "studyType": "Onsite event",
      "startDate": "2016-10-07",
      "endDate": "2016-10-08"
    },
    {
      "institution": "École Polytechnique Fédérale de Lausanne",
      "area": "Functional Programming Principles in Scala",
      "studyType": "Virtual Course",
      "startDate": "2016-07-11",
      "endDate": "2016-08-15"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "1212959 - English Dot Works 1",
      "studyType": "Virtual Course",
      "startDate": "2016-06-01",
      "endDate": "2016-07-21"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "1165235 - English Dot Works Beginner",
      "studyType": "Virtual Course",
      "startDate": "2016-04-01",
      "endDate": "2016-05-10"
    },
    {
      "institution": "The Hong Kong University of Science and Technology",
      "area": "HTML, CSS and JavaScript",
      "studyType": "Virtual Course",
      "startDate": "2016-02-22",
      "endDate": "2016-03-10"
    },
    {
      "institution": "Universidad de Washington",
      "area": "Machine Learning Foundations: A Case Study Approach",
      "studyType": "Virtual Course",
      "startDate": "2015-11-23",
      "endDate": "2015-12-21"
    },
    {
      "institution": "University of London & Goldsmiths, University of London",
      "area": "Responsive Website Basics: Code with HTML, CSS, and JavaScript",
      "studyType": "Virtual Course",
      "startDate": "2015-09-21",
      "endDate": "2015-10-15"
    },
    {
      "institution": "Johns Hopkins University",
      "area": "The Data Scientist Toolbox",
      "studyType": "Curso Virtual",
      "startDate": "2015-06-01",
      "endDate": "2015-07-31"
    },
    {
      "institution": "Stanford University",
      "area": "Cryptography I",
      "studyType": "Virtual Course",
      "startDate": "2015-01-01",
      "endDate": "2015-03-20"
    },
    {
      "institution": "MongoDB University",
      "area": "M101P: MongoDB for Developers",
      "studyType": "Virtual Course",
      "startDate": "2014-04-01",
      "endDate": "2014-06-10"
    },
    {
      "institution": "University of New Mexico",
      "area": "Web Application Architectures",
      "studyType": "Virtual Course",
      "startDate": "2014-03-01",
      "endDate": "2014-06-02"
    },
    {
      "institution": "MongoDB University",
      "area": "M101JS: MongoDB for Node.js Developers",
      "studyType": "Virtual Course",
      "startDate": "2014-03-01",
      "endDate": "2014-05-24"
    },
    {
      "institution": "MongoDB University",
      "area": "M101J: MongoDB for Java Developers",
      "studyType": "Virtual Course",
      "startDate": "2014-03-01",
      "endDate": "2014-05-06"
    },
    {
      "institution": "Clínica San Francisco S.A.",
      "area": "42914 - Humanization of the Health Service",
      "studyType": "Classroom Course",
      "startDate": "2013-09-01",
      "endDate": "2013-10-25"
    },
    {
      "institution": "Manizales Vive Digital program ran by PeopleContact S.A.",
      "area": "Mobile Devices Development on ANDROID",
      "studyType": "Classroom Course",
      "startDate": "2012-07-01",
      "endDate": "2012-09-13"
    },
    {
      "institution": "Manizales Vive Digital program ran by PeopleContact S.A.",
      "area": "BPO SQL/Oracle",
      "studyType": "Classroom Course",
      "startDate": "2012-01-01",
      "endDate": "2012-09-13"
    },
    {
      "institution": "Manizales Vive Digital program ran by PeopleContact S.A.",
      "area": "BPO .NET",
      "studyType": "Classroom Course",
      "startDate": "2011-12-01",
      "endDate": "2012-09-13"
    },
    {
      "institution": "Manizales Vive Digital program ran by PeopleContact S.A.",
      "area": "BPO Java",
      "studyType": "Classroom Course",
      "startDate": "2011-12-01",
      "endDate": "2012-09-13"
    },
    {
      "institution": "MKit IT & Security Solutions",
      "area": "Ethical Hacking free course",
      "studyType": "Virtual Course",
      "startDate": "2012-02-01",
      "endDate": "2012-03-12"
    },
    {
      "institution": "Course offered by SENA under the auspices of PeopleContact S.A.",
      "area": "329366 - Information Systems Development using Java EE platform",
      "studyType": "Classroom Course",
      "startDate": "2012-02-01",
      "endDate": "2012-03-09"
    },
    {
      "institution": "Course offered by SENA under the auspices of PeopleContact S.A.",
      "area": "322340 - BPO Databases with MySQL",
      "studyType": "Classroom Course",
      "startDate": "2012-01-01",
      "endDate": "2012-02-20"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "21730030 - Web design with Adobe Dreamweaver CS3",
      "studyType": "Virtual Course",
      "startDate": "2011-10-01",
      "endDate": "2011-11-28"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "21720038 - Using Adobe Photoshop CS3",
      "studyType": "Virtual Course",
      "startDate": "2011-10-01",
      "endDate": "2011-11-24"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "21730134 - Mobile Devices Programming (MDP)",
      "studyType": "Virtual Course",
      "startDate": "2011-10-01",
      "endDate": "2011-11-17"
    },
    {
      "institution": "Training program from Microsoft developers community",
      "area": "Microsoft Five Stars Developer Level 5",
      "studyType": "Virtual Course",
      "startDate": "2011-03-01",
      "endDate": "2011-04-01"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "12210039 - English Discoveries - Basic III",
      "studyType": "Virtual Course",
      "startDate": "2010-08-01",
      "endDate": "2010-09-17"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "12210037 - English Discoveries - Basic I",
      "studyType": "Virtual Course",
      "startDate": "2010-05-01",
      "endDate": "2010-06-18"
    },
    {
      "institution": "Course offered by Servicio Nacional de Aprendizaje SENA",
      "area": "52410017 - Flash - 2D Animation",
      "studyType": "Virtual Course",
      "startDate": "2010-02-01",
      "endDate": "2010-04-09"
    },
    {
      "institution": "ExpoASI 2009 (Universidad Nacional)",
      "area": "AJAX use on ASP.NET",
      "studyType": "Classroom Workshop",
      "startDate": "2009-10-01",
      "endDate": "2009-10-01"
    },
    {
      "institution": "time4code Training",
      "area": "Web development with Ruby on Rails",
      "studyType": "Virtual Course",
      "startDate": "2009-05-01",
      "endDate": "2009-07-01"
    },
    {
      "institution": "Microsoft Installation Festival 2009 (Universidad de Caldas)",
      "area": "DNN (DotNetNuke) and jQuery on the Web (Workshop)",
      "studyType": "Classroom Workshop",
      "startDate": "2009-05-01",
      "endDate": "2009-05-01"
    },
    {
      "institution": "Universidad de Caldas",
      "area": "Microsoft Installation Festival",
      "studyType": "Classroom Workshop",
      "startDate": "2009-05-01",
      "endDate": "2009-05-01"
    },
    {
      "institution": "X Engineering Days from Universidad de Caldas",
      "area": "Web oriented programming with .NET Basic seminar",
      "studyType": "Course-Classroom Workshop",
      "startDate": "2008-10-07",
      "endDate": "2008-10-10"
    },
    {
      "institution": "University of Manizales",
      "area": "Linux first level",
      "studyType": "Classroom Course",
      "startDate": "2001-01-01",
      "endDate": "2001-06-30"
    },
    {
      "institution": "University of Manizales",
      "area": "GNU/Linux Congress Eje Cafetero",
      "studyType": "Congress",
      "startDate": "2001-05-10",
      "endDate": "2001-05-11"
    }
  ],
  "awards": [
    {
      "title": "Basic Xamarin completed",
      "date": "2017-03-21",
      "awarder": "Microsoft Developer Readiness",
      "summary": "Basic Xamarin course finished."
    }
  ],
  "publications": [
    {
      "name": "Mantacore Sky Blog",
      "publisher": "Mantacore Sky",
      "releaseDate": "2023-06-21",
      "website": "http://da8y01.gitlab.io/gl-blog/",
      "summary": "A miscellaneous blog (IT and literature mainly)."
    },
    {
      "name": "Trashumantes website",
      "publisher": "Trashumantes",
      "releaseDate": "2017-02-14",
      "website": "https://tras-humantes.net/",
      "summary": "A personal and miscellaneous website."
    },
    {
      "name": "Easy Engineering - Blog",
      "publisher": "Easy Engineering",
      "releaseDate": "2013-05-07",
      "website": "http://da8y01.github.io/gh-blog/",
      "summary": "A blog dedicated to reading and various subjects."
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "Master",
      "keywords": [
        "Ruby",
        "Python",
        "Java",
        "JavaScript",
        "C",
        "C++",
        "C#",
        "VisualBasic",
        "assembler",
        "bash",
        "PowerShell"
      ]
    },
    {
      "name": "Web",
      "level": "Master",
      "keywords": [
        "Rails",
        "Django",
        "PHP",
        "NodeJS",
        "AngularJS",
        "Angular",
        "ReactJS",
        "Servlets/JSP/EJB",
        ".NET",
        "JavaScript",
        "HTML",
        "CSS",
        "CoffeeScript",
        "HAML",
        "SAAS",
        "Frameworks PHP: Yii, Cake, Symfony, Silex, CodeIgniter, Zend",
        "CMS: WordPress, Joomla, Drupal, PHPNuke, phpWebSite, DotNetNuke"
      ]
    },
    {
      "name": "Databases",
      "level": "Master",
      "keywords": [
        "MySQL",
        "Postgres",
        "SQL Server",
        "Oracle",
        "MongoDB"
      ]
    },
    {
      "name": "Mobile",
      "level": "Intermediate",
      "keywords": [
        "Android",
        "Ionic",
        "Appcelerator Titanium",
        "Java ME",
        "BlackBerry"
      ]
    },
    {
      "name": "Operating Systems",
      "level": "Master",
      "keywords": [
        "Linux",
        "Windows",
        "VMs and virtualization (VMware, VirtualBox, Hyper-V, KVM, LXC)",
        "Docker containers",
        "CVSs y repositories (git, subversion, GitHub, BitBucket, GitLab, Unfuddle)",
        "Cloud services (Amazon EC2, GCP, GKE, Microsoft Azure)",
        "PaaS",
        "IaaS (Heroku, Hasura, Docker Hub, Amazon, Azure)"
      ]
    },
    {
      "name": "General IT",
      "level": "Master",
      "keywords": [
        "networking",
        "algorithmics",
        "offimatic",
        "architecture",
        "patterns",
        "electronics",
        "management"
      ]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native language"
    },
    {
      "language": "English",
      "fluency": "Intermediate. Berlitz Proficiency Test Number: 35162, Expedition date: June 2013. Level: B1."
    },
    {
      "language": "English",
      "fluency": "Advanced. EF SET Certificate 70/100 C1 Advanced. Awarded on: 26 Apr 2022. https://efset.org/cert/cowZZo"
    }
  ]
}